---
kind: type
id: T:Autodesk.Revit.Exceptions.WrongUserException
source: html/e445bf18-84d1-83f2-6b24-45a6a6fe2bd9.htm
---
# Autodesk.Revit.Exceptions.WrongUserException

The exception thrown when a local model is manipulated under
a different username than it was created with.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class WrongUserException : InvalidOperationException
```